#include <iostream>
using namespace std;
int main() {
  //Необходимо, чтоб программа выводила на экран вот такую последовательность:7 14 21 28 35 42 49 56 63 70 77 84 91 98
	//int a = 7;
	//while (a <= 98) {
	//	cout << a << " ";
	//	a += 7;
	//}
	//Необходимо вывести на консоль такую последовательность чисел:1 2 4 8 16 32 64 128 256 512
	//int a = 1;
	//while (a <= 512) {
	//	cout << a << " ";
	//	a *= 2;
	//}
	//8.Даны натуральные числа от 20 до 50.Напечатать те из них, которые делятся на 3, но не делятся на 5.
	//int a= 20;
	//while (a <= 50) {		
	//	if ( a % 3 == 0 &&  a % 5!= 0 )
	//	cout << a << " ";
	//	a += 1;
	//}
	//9. даны натуральные числа от 35 до 87. Найти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
	/*int a = 35;
	while (a <= 87) {
		if (a % 7 == 1 || a % 7 == 2 || a & 7 == 5) {
			cout << a << " ";
		}
		a++;
	 }*/
	//10. Даны натуральные числа от 1 до 50. Найти сумму тех из них, которые делятся на 5 или на 7.
	//int r , sum = 0;
	//r = 1;
	//while (r <= 50) {
	//	if (r % 5 == 0 || r % 7 == 0) {
	//		sum += r;
	//	}
	//	r++;
	//}
	//cout << sum << " ";
	//11. Напечатать те из двузначных чисел которые делятся на 4, но не делятся на 6.
	/*int q = 10;
	while (q <= 99) {
		if (q % 4 == 0 && q % 6 != 0) {
			cout << q << " ";
		}
		q += 1;
	}*/
	//12. Найти произведение двузначных нечетных чисел кратных 13.
	/*int a = 1, q = 100;
	while (q <= 999) {
		if (q % 13 == 0 && q % 2 !=0) {
			a *= q;
		}
		q++;
	}
	cout << a << " ";*/
	//13. Найти сумму чисел от 100 до 200 кратных 17.
	//int a = 100;
	//int sum = 1;
	//while (a <= 200) {
	//	if (a % 17 == 0) {
	//		sum += a;
	//	}
	//	a++;
	//}
	//cout << sum << " ";
	//14. Составьте программу, которая вычисляет сумму квадратов чисел от 1 до введенного вами целого числа N.
	/*int a, n, sum;
	a = 1;  sum = 1;
	cin >> n;
	while (a <= n) {
		sum += a * a;
		cout << sum << " ";
		a++;
	}*/
}